"""

7. Одиниці маси пронумеровані в такий спосіб: 1 - кілограм, 2 - міліграм, 3 - грам, 4 - тонна, 5 -
центнер. Дано номер одиниці маси (ціле число в діапазоні 1-5) і маса тіла в цих одиницях (дійсне
число). Знайти масу тіла в кілограмах.
Єзелевич Ю.

"""


def mass_to_kilo(x, y) -> float:
    match x:
        case 1:
            return y
        case 2:
            return y/1000000
        case 3:
            return y/1000
        case 4:
            return y*1000
        case 5:
            return y*100


if __name__ == '__main__':
    m = float(input("Введите массу = "))
    print("Введите число 1-5 (кг, мг, г, тонна, центнер")
    a = int(input("а = "))
    while 1 > a > 5:
        a = int(input("Ошибка! Введите число 1-5"))
    print(mass_to_kilo(a, m), "kg")
