"""

17. Дано три цілих числа. Визначте, скільки серед них збігаються. Програма повинна вивести одне з
чисел: 3 (якщо все збігаються), 2 (якщо два збігається) або 0 (якщо все числа різні).
Єезелевич Ю.

"""


def count(x, y, z):
    if x == y == z:
        return 3
    elif x == y != z:
        return 2
    elif x == z != y:
        return 2
    elif y == z != x:
        return 2
    else:
        return 0


if __name__ == '__main__':
    a = int(input("Введіть 1 число = "))
    b = int(input("Введіть 2 число = "))
    c = int(input("Введіть 3 число = "))
    print(count(a, b, c))
