"""

8. Дано рядок, що зображає двійкову запис цілого позитивного числа. Вивести десяткову запис цього
ж числа.
Єзелевич Ю.

"""


def bin_to_ten(t):
    return int(t, 2)


if __name__ == "__main__":
    b = str(input("Введите двоичное число = "))
    print(bin_to_ten(b))
