"""

7. Дано рядок. Розріжте його на дві рівні частини (якщо довжина рядка - парна, а якщо довжина
рядка непарна, то довжина першої частини повинна бути на один символ більше). Переставте ці дві
частини місцями, результат запишіть в новий рядок і виведіть на екран.
Єзелевич Ю.

"""


def swap(x):
    half = len(x) // 2
    num = len(x) % 2
    if num > 0:
        half += 1
    x = x[half:]+x[:half]
    return x


if __name__ == "__main__":
    a = str(input("Введите строку: "))
    print(swap(a))
