"""

12.Написати програму циклічного зсуву елементів списку вліво. Наприклад, дано список:
[1,2,3,4,5,6] після зсуву на один елемент вліво, повинні отримати: [2,3,4,5,6,1].
Єзелевич Ю.

"""


def zsuv(x):
    x.append(x[0])
    x.remove(x[0])
    return x


if __name__ == "__main__":
    n = int(input("Введите число элементов списка: "))
    a = list()
    for i in range(n):
        e = str(input(f"Введите {i+1}-й элемент списка: "))
        a.append(e)
    print(a)
    print(zsuv(a))
