"""

2. Дана сторона квадрата a. Знайти його площу S=a2.

Єзелевич Ю.

"""


def square(a) -> float:
    return a**2


a = float(input("Длина стороны квадрата = "))
print("Площадь квадрата = ", square(a))
