"""

12. Дано значення кута α в градусах (0 ≤ α < 360). Обчислити значення цього ж кута в радіанах,
враховуючи, що 180 ° = π радіанів. У якості значення π використовувати 3.14.

Єзелевич Ю.

"""


def radian(a) -> float:
    Pi = float(3.14)
    r = a*Pi/180
    return r


a = float(input("Введите угол (0 ≤ α < 360) = "))
while a >= 360 or a < 0:
    a = float(input("Ошибка! Введите угол (0 ≤ α < 360) = "))
print("Заданный угол в радианах = ", radian(a))
